src/cf/Логистика/src/Documents/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Списание</name>
  <registerRecords>AccumulationRegister.ТоварыКРасходуСоСклада</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/Логистика/src/Documents/Списание/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
// Получает таблицу по товарам для проведения.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.Списание - Ссылка на документ.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица по товарам для проведения.
//
Функция ПолучитьТаблицуПоТоварам(ДокументСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Товары.Ссылка КАК Документ,
	|	Товары.Ссылка.Склад КАК Склад,
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.Количество) КАК Количество
	|ИЗ
	|	Документ.Списание.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ДокументСсылка
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Товары.Ссылка,
	|	Товары.Ссылка.Склад,
	|	Товары.Номенклатура";
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
#КонецОбласти

#КонецЕсли
